app/Controllers/EnderecoController.php

SELECT *
FROM `enderecos`
JOIN `users` ON `users`.`id` = `id_user`
---
    public function get_all_endereco()
    {
        $EnderecoModel = new EnderecoModel();
        $payload = array_map(function ($index) {
            return [
                "nome" => $index["user_name"],
                "estado" => $index["estado"],
                "cidade" => $index["cidade"],
                "endereco" => $index["endereco"],
                "numero" => $index["numero"],
                "complemento" => $index["complemento"],
            ];
        }, $EnderecoModel->join("users", "users.id = id_user")->findAll());