app/Models/UserModel.php

    public function registerUser(
        string $user_name,
        string $user_email,
        string $user_password
    ): void {
        $table = $this->banco->table('users');
        $table->insert([
            "id" => new RawSql('DEFAULT'),
            "user_name" => $user_name,
            "user_email" => $user_email,
            "user_password" => password_hash($user_password, PASSWORD_DEFAULT),
            "created_at" => new RawSql('CURRENT_TIMESTAMP()'),
            "updated_at" => new RawSql('CURRENT_TIMESTAMP()')
        ]);
---
INSERT INTO `users` (`id`, `user_name`, `user_email`, `user_password`, `created_at`, `updated_at`) VALUES (DEFAULT, 'vitorfernando', 'victor@gmail.com', '$2y$10$cRY9uf4tQ3cOS9A2E4jC7O6plXdJQT.IYFLC8TnoICKqUAB.8dIEq', CURRENT_TIMESTAMP(), CURRENT_TIMESTAMP())

    public function searchUser_by_name(string $user_name): array
    {
        $table = $this->banco->table('users');
        $get_user = $table->where("user_name", $user_name)->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `user_name` = 'vitorfernando'

    public function searchUser_by_email(string $user_email): array
    {
        $table = $this->banco->table('users');
        $get_user = $table->where("user_email", $user_email)->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `user_email` = 'victor@gmail.com'

    public function existUser(string $user_email): bool
    {
        $table = $this->banco->table('users');
        $get_user = $table->where("user_email", $user_email)->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `user_email` = 'victor@gmail.com'

    public function login(string $user_email, string $user_password): array
    {
        $table = $this->banco->table('users');
        $get_user_by_email = $table->where('user_email', $user_email)->get()->getResultArray()[0];
---
SELECT *
FROM `users`
WHERE `user_email` = 'victor@gmail.com'